Documents/ВнесениеИзмененийВоВнутреннийПеречень.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ВнесениеИзмененийВоВнутреннийПеречень</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ВнутренниеПеречни</xr:Item>
				<xr:Item>InformationRegister.ОснованияВнесенияВПеречень</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПеречня</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПеречнейОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидИзменения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыИзмененийПеречней</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектИнсайдерскойИнформации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыВнутреннихПеречней</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьЧленаСоветаДиректоров</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодтверждающиеДокументыКвалифицированногоИнвестора</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаИсключенияКвалифицированногоЛица</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВнутреннийДокумент</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Основания</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НормативныйАкт</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НормативныеАкты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Основание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Категория</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НормативныеАкты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВидыАктивовКвалифицированныхИнвесторов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидАктива</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыВнутреннихПеречней</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ВнесениеИзмененийВоВнутреннийПеречень/Ext/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект, ДанныеЗаполнения);
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)

	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект);

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЭтотОбъект.ВидПеречня = Справочники.ВидыПеречнейОбъектов.Инсайдеры Тогда
		
		ПроверяемыеРеквизиты.Добавить("Основания");
		ПроверяемыеРеквизиты.Добавить("Основания.Основание");
		ПроверяемыеРеквизиты.Добавить("Основания.Категория");
		
		Пункт13статьи4Закона224 = ОбщегоНазначения.ПолучитьИменованныйОбъект("Пункт13статьи4Закона224");
		
		Для Каждого СтрокаОснование Из ЭтотОбъект.Основания Цикл
			Если СтрокаОснование.Категория = Пункт13статьи4Закона224 И НЕ ЗначениеЗаполнено(СтрокаОснование.Сотрудник) Тогда //для п. 13 сотрудник обязателен, для п. 7 - опционален 
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Поле сотрудник не заполнено", ЭтотОбъект, СтрШаблон("Основания[%1].Сотрудник", СтрокаОснование.НомерСтроки - 1),, Отказ);
			КонецЕсли;
		КонецЦикла;
		
	ИначеЕсли (ЭтотОбъект.ВидПеречня = Справочники.ВидыПеречнейОбъектов.ДолжностныеЛицаНАУФОР
				ИЛИ ЭтотОбъект.ВидПеречня = Справочники.ВидыПеречнейОбъектов.ДолжностныеЛицаПН)
		И (ЭтотОбъект.ВидИзменения = Перечисления.ВидыИзмененийПеречней.Включение
			ИЛИ ЭтотОбъект.ВидИзменения = Перечисления.ВидыИзмененийПеречней.Изменение) Тогда
		
		Если НЕ ЗначениеЗаполнено(ЭтотОбъект.ДолжностьЧленаСоветаДиректоров)
			И (ЭтотОбъект.Основания.Количество() = 0
				ИЛИ НЕ ЗначениеЗаполнено(ЭтотОбъект.Основания[0].Сотрудник)) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для должностного лица должен быть выбран сотрудник или должность члена Совета директоров",,,, Отказ);
		КонецЕсли;	
		
	ИначеЕсли ЭтотОбъект.ВидПеречня = Справочники.ВидыПеречнейОбъектов.СотрудникиПроходящиеОбучениеПОДФТ Тогда		
		ПроверяемыеРеквизиты.Добавить("Основания");
		ПроверяемыеРеквизиты.Добавить("Основания.Сотрудник");
		
	КонецЕсли; 
	
	УниверсальныеМеханизмы.ПослеОбработкиПроверкиЗаполнения(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// предварительная обработка объекта
	РаботаСДокументами.ПередЗаписью(ЭтотОбъект);

	Если ЭтотОбъект.ВидПеречня = Справочники.ВидыПеречнейОбъектов.Инсайдеры Тогда
		
		ЭтотОбъект.ВидыАктивовКвалифицированныхИнвесторов.Очистить();

		КатегорииДляКоторыхУказываетсяСотрудник = Новый Массив;
		КатегорииДляКоторыхУказываетсяСотрудник.Добавить(ОбщегоНазначения.ПолучитьИменованныйОбъект("Пункт13статьи4Закона224"));
		КатегорииДляКоторыхУказываетсяСотрудник.Добавить(ОбщегоНазначения.ПолучитьИменованныйОбъект("пункт7статьи4Закона224"));
		
		Для Каждого СтрокаОснование Из ЭтотОбъект.Основания Цикл
			Если КатегорииДляКоторыхУказываетсяСотрудник.Найти(СтрокаОснование.Категория) = Неопределено Тогда
				СтрокаОснование.Сотрудник = Неопределено;
			КонецЕсли;
		КонецЦикла;
		
	ИначеЕсли ЭтотОбъект.ВидПеречня = Справочники.ВидыПеречнейОбъектов.КвалифицированныеИнвесторы Тогда
		
		ЭтотОбъект.Основания.Очистить();

		// Виды активов не могут быть пустыми
		Если ЭтотОбъект.ВидыАктивовКвалифицированныхИнвесторов.Количество() = 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнена таблица видов активов",,,, Отказ);			
			Возврат;
		КонецЕсли;
				
		// Получаем действующий список активов
		РезультатЗапроса = Документы.ВнесениеИзмененийВоВнутреннийПеречень.РезультатЗапросаПоВидамАктивов(ЭтотОбъект.Организация, ЭтотОбъект.Объект, ?(ЭтотОбъект.ЭтоНовый(), ЭтотОбъект.Дата, ЭтотОбъект.МоментВремени()));
	
		МассивВидовАктивовДоИзменения = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("ВидАктива");
		
		СтруктураИзменений = Документы.ВнесениеИзмененийВоВнутреннийПеречень.СформироватьСтруктуруИзмененийСоставаВидовАктивов(МассивВидовАктивовДоИзменения, ЭтотОбъект.ВидыАктивовКвалифицированныхИнвесторов.Выгрузить().ВыгрузитьКолонку("ВидАктива"));
		 		
		МассивОшибок = Новый Массив;
		
		// Проверка подтверждающих документов (нужна при добавлении новых видов активов) 
		Если ЭтотОбъект.ВидИзменения = Перечисления.ВидыИзмененийПеречней.Включение 
			Или ЭтотОбъект.ВидИзменения = Перечисления.ВидыИзмененийПеречней.Изменение И СтруктураИзменений.ДобавленныеВидыАктивов.Количество() > 0 Тогда
			
			// Получаем подтверждающие документы из хранилища, чтобы проверить заполнение
			ПодтверждающиеДокументы = ПодтверждающиеДокументыКвалифицированногоИнвестора.Получить();
			
			Если ПодтверждающиеДокументы = Неопределено 
				Или ТипЗнч(ПодтверждающиеДокументы) = Тип("Структура") И ПодтверждающиеДокументы.Количество() = 0 Тогда
				
				МассивОшибок.Добавить("Не указаны подтверждающие документы квалифицированного инвестора");
				
			КонецЕсли;
			
		КонецЕсли;
		
		// Проверка причины исключения (нужна при удалении видов активов) 
		Если (ЭтотОбъект.ВидИзменения = Перечисления.ВидыИзмененийПеречней.Исключение 
			Или ЭтотОбъект.ВидИзменения = Перечисления.ВидыИзмененийПеречней.Изменение И СтруктураИзменений.УдаленныеВидыАктивов.Количество() > 0)
			И ПустаяСтрока(ПричинаИсключенияКвалифицированногоЛица) Тогда
			МассивОшибок.Добавить("Не указана причина исключения квалифицированного лица");
		КонецЕсли;  				
		
		// Вид изменения Исключение может быть только для всех действующих активов
		Если ЭтотОбъект.ВидИзменения = Перечисления.ВидыИзмененийПеречней.Исключение И СтруктураИзменений.ДобавленныеВидыАктивов.Количество() + СтруктураИзменений.УдаленныеВидыАктивов.Количество() > 0 Тогда
			
			СтрДобавлены = СтрСоединить(СтруктураИзменений.ДобавленныеВидыАктивов, ",");
			СтрУдалены = СтрСоединить(СтруктураИзменений.УдаленныеВидыАктивов, ",");
			
			МассивОшибок.Добавить("Для вида изменения 'Исключение' в таблице активов должны быть только все действующие на дату документа." + ?(ПустаяСтрока(СтрДобавлены), "", Символы.ПС + "Добавлены: " + СтрДобавлены)  + ?(ПустаяСтрока(СтрУдалены), "", Символы.ПС + "Удалены: " + СтрУдалены ));
			
		КонецЕсли;	
			        	
		Если МассивОшибок.Количество() > 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрСоединить(МассивОшибок, Символы.ПС),,,,Отказ);			
		КонецЕсли;

	Иначе
		
		ЭтотОбъект.ВидыАктивовКвалифицированныхИнвесторов.Очистить();
        //#техдолг дополнить условие на очистку ТЧ Основания и на форме		
	КонецЕсли;
	
	Если ЭтотОбъект.Основания.Количество() И ЭтотОбъект.ВидИзменения <> Перечисления.ВидыИзмененийПеречней.Исключение Тогда
		ПроверкаСотрудникиРаботаютНаДатуВключенияИзменения(Отказ);
	КонецЕсли;
	
	Если Не УниверсальныеМеханизмы.ОбъектМожноЗаписать(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;	
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.ВнутренниеПеречни.Записывать = Истина;
	Движения.ОснованияВнесенияВПеречень.Записывать = Истина;
		
	Если ЭтотОбъект.ВидИзменения = Перечисления.ВидыИзмененийПеречней.Включение 
		Или ЭтотОбъект.ВидИзменения = Перечисления.ВидыИзмененийПеречней.Исключение Тогда
		
		Движение = Движения.ВнутренниеПеречни.Добавить();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Объект = Объект;
		Движение.ВидПеречня = ВидПеречня;
		Движение.Действует = (ЭтотОбъект.ВидИзменения = Перечисления.ВидыИзмененийПеречней.Включение);
		
	КонецЕсли;
	
	Движение = Движения.ОснованияВнесенияВПеречень.Добавить();
	Движение.Период = ЭтотОбъект.Дата;
	Движение.Организация = ЭтотОбъект.Организация;
	Движение.Объект = ЭтотОбъект.Объект;
	Движение.ВидПеречня = ВидПеречня;
	Движение.Основание = ЭтотОбъект.Ссылка;
	
	Если ЭтотОбъект.ВидИзменения = Перечисления.ВидыИзмененийПеречней.Включение Тогда
		Если ЭтотОбъект.ВидПеречня = Справочники.ВидыПеречнейОбъектов.ДолжностныеЛицаНАУФОР
		 ИЛИ ЭтотОбъект.ВидПеречня = Справочники.ВидыПеречнейОбъектов.ДолжностныеЛицаПН Тогда
			РегистрыСведений.ЖурналСверкиСоСписками.ВыполнитьСверкуСоСпискомДисквалифицированныхЛиц(ЭтотОбъект.Организация, ЭтотОбъект.Объект, ЭтотОбъект.Дата,,, Новый Структура("ДолжностноеЛицо, ДатаПоследнейСверки", ЭтотОбъект.Объект, ЭтотОбъект.Дата));
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

Процедура ПроверкаСотрудникиРаботаютНаДатуВключенияИзменения(Отказ)
	
	Сотрудники = Новый Массив;
	
	Для Каждого СтрокаОснование Из ЭтотОбъект.Основания Цикл
		Если ЗначениеЗаполнено(СтрокаОснование.Сотрудник) Тогда
			Сотрудники.Добавить(СтрокаОснование.Сотрудник);
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ Сотрудники.Количество() Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Организация",	ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("Дата",			ЭтотОбъект.Дата);
	Запрос.УстановитьПараметр("Сотрудники", 	Сотрудники);
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Сотрудники.Ссылка КАК Сотрудник
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СотрудникиОрганизации.СрезПоследних(&Дата, Организация = &Организация) КАК СотрудникиОрганизацииСрезПоследних
		|		ПО Сотрудники.Ссылка = СотрудникиОрганизацииСрезПоследних.Сотрудник
		|ГДЕ
		|	Сотрудники.Ссылка В(&Сотрудники)
		|	И ISNULL(СотрудникиОрганизацииСрезПоследних.ВидСобытия, ЗНАЧЕНИЕ(Перечисление.ВидыКадровыхСобытий.Увольнение)) = ЗНАЧЕНИЕ(Перечисление.ВидыКадровыхСобытий.Увольнение)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Сотрудник %1 не может быть выбран в документе, по состоянию на %2 сотрудник не работает", Выборка.Сотрудник, Формат(ЭтотОбъект.Дата, "ДФ=dd.MM.yyyy")), ЭтотОбъект.Ссылка,,, Отказ);
	КонецЦикла;
	
КонецПроцедуры
